###### 12. Выбрать произвольный набор данных, загрузить его из csv файла.  Создать датафрейм. Добавить в него новый столбец на 5 значений. Сохранить результат в файл csv.

In [98]:
import numpy as np
import pandas as pd

In [99]:
df = pd.read_csv('pokemon_data.csv')

df.head(5)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [100]:
# я не совсем понял задание и создал столбец в котором соединил 6 значений из других столбцов
df['Total'] = df['HP'] + df['Attack'] + df['Defense'] + df['Sp. Atk'] + df['Sp. Def'] + df['Speed']
df.head(5)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Total
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False,318
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False,405
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False,525
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False,625
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False,309

In [101]:
# check of Total column
45+49+49+65+65+45

318

In [102]:
# create variable in order to shift column's position
total = df.pop('Total')

# shifting column 'Total'
df.insert(4, 'Total', total)

In [103]:
df.head(5)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [104]:
df.to_csv('modified.csv', index=False)

#### Возьмите данные о заказах и покупателях и посчитайте (для каждого варианта свое значение n берем по списку):
###### 1.	Сколько заказов, отправлено первым классом за последние n лет?
###### 2.	Сколько в базе клиентов из Калифорнии?
###### 3.	Сколько заказов они сделали?
###### 4.	Постройте сводную таблицу средних чеков по всем штатам за последние n лет.

In [105]:
df_orders = pd.read_csv('orders.csv')
df_customers = pd.read_csv('customers.csv')

###### 1.	Сколько заказов, отправлено первым классом за последние n лет?

In [106]:
new_df_orders = df_orders.loc[df_orders['order_date'] >= '2010-01-01']
new_df_orders.groupby('ship_mode').count()['id']

ship_mode
First        787
Same Day     264
Second       964
Standard    2994
Name: id, dtype: int64

###### 2.	Сколько в базе клиентов из Калифорнии?

In [107]:
df_customers.groupby('state').count()['id']

state
Alabama                   9
Arizona                  21
Arkansas                  2
California              161
Colorado                 20
Connecticut               7
Delaware                  6
District of Columbia      1
Florida                  24
Georgia                  17
Illinois                 41
Indiana                  12
Iowa                      3
Kansas                    1
Kentucky                 13
Louisiana                 6
Maryland                  4
Massachusetts            10
Michigan                 16
Minnesota                13
Mississippi               5
Missouri                  6
Nebraska                  2
Nevada                    2
New Hampshire             2
New Jersey               10
New Mexico                4
New York                 87
North Carolina           30
Ohio                     38
Oklahoma                  3
Oregon                    3
Pennsylvania             50
Rhode Island              5
South Dakota              1
Tennessee                13
Texas                    77
Utah                      6
Virginia                 15
Washington               38
Wisconsin                 9
Name: id, dtype: int64

###### 3.	Сколько заказов они сделали?

In [108]:
new = df_customers.loc[df_customers['state'] == "California"]

In [109]:
counter = 0
for i in range(new['id'].count()):
    counter += df_orders['id'].loc[df_orders['customer_id'] == new.iloc[i, 0]].count()
print(counter)

1006

###### 4.	Постройте сводную таблицу средних чеков по всем штатам за последние n лет.

In [110]:
state_df = df_customers['state'].unique()

In [111]:
arr = np.array([])
for state in range(state_df.size):
    tmp_state = df_customers.loc[df_customers['state'] == state_df[state]]
    n = 0
    for i in range(tmp_state['id'].count()):
        n += df_orders['sales'].loc[df_orders['customer_id'] == tmp_state.iloc[i, 0]].mean()

    arr = np.append(arr, [n / tmp_state['id'].count()])

In [112]:
result_df = pd.DataFrame({
    'state': state_df,
    'mean': arr
})

print(result_df)

                   state        mean
0               Kentucky  348.451552
1             California  438.608065
2                Florida  377.443522
3         North Carolina  708.421501
4             Washington  616.616592
5                  Texas  406.828192
6              Wisconsin  690.996987
7                   Utah  385.512420
8               Nebraska  738.975583
9           Pennsylvania  445.661107
10              Illinois  345.689503
11             Minnesota  582.453228
12              Michigan  550.908629
13              Delaware  400.807606
14               Indiana  267.898848
15              New York  504.381930
16               Arizona  604.896878
17              Virginia  619.487907
18             Tennessee  437.637149
19               Alabama  543.746523
20                Oregon  722.551716
21              Colorado  418.626991
22                  Iowa  407.510256
23                  Ohio  304.697870
24              Missouri  477.211253
25              Oklahoma  404.314022
26            New Mexico  284.529986
27             Louisiana  431.579775
28           Connecticut  465.187774
29            New Jersey  373.637024
30         Massachusetts  456.712028
31               Georgia  474.459552
32                Nevada  187.758733
33          Rhode Island  404.876473
34           Mississippi  592.505611
35              Arkansas  371.049036
36              Maryland  111.746556
37  District of Columbia  366.408333
38                Kansas  287.942000
39         New Hampshire  741.071542
40          South Dakota  292.449750